Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/family_support_agency.html.txt.tmx
Source language: en
Languages: ga

source: Tusla - the Child and Family Agency
ga: Tusla - an Ghníomhaireacht um Leanaí agus an Teaghlach

source: Tusla - the Child and Family Agency - is a statutory organisation, established in January 2014 under the Child and Family Agency Act 2013
ga: Is í Tusla - an Ghníomhaireacht um Leanaí agus an Teaghlach - ná eagraíocht reachtúil a bunaíodh i mí Eanáir 2014 faoin Acht fán nGníomhaireacht um Leanaí agus an Teaghlach 2013

source: Under Section 8 of the Act, it is required to:
ga: Faoi Alt 8 den Acht, ceanglaítear uirthi:

source: • Support and promote the development, welfare and protection of children, and
ga: • Tacú leis an bhforbairt, leis an leas agus leis an gcosaint leanaí agus iad a chur chun cinn, agus

source: • Support and encourage the effective functioning of families
ga: • Tacú leis an bhfeidhmiú éifeachtach teaghlach agus é a spreagadh

source: It also provides information and advice to the Minister for Children and Youth Affairs on matters relating to the agency’s areas of responsibility
ga: Ina theannta sin, cuireann sí faisnéis agus comhairle ar fáil don Aire Leanaí agus Gnóthaí Óige maidir le cúrsaí a bhaineann le réimsí freagrachta na gníomhaireachta

source: Tusla has assumed responsibility for the following range of services:
ga: Ghlac Tusla freagracht as an raon seirbhísí seo a leanas:

source: • Child welfare and protection services previously operated by the Health Service Executive (including family support services)
ga: • Seirbhísí leasa agus cosanta leanaí a d’fheidhmigh Feidhmeannacht na Seirbhíse Sláinte roimhe sin (seirbhísí tacaíochta teaghlaigh san áireamh)

source: • The services previously provided by the former Family Support Agency
ga: • Na seirbhísí a chuir an iarGhníomhaireacht um Thacaíocht Teaghlaigh ar fáil roimhe sin

source: • The services previously provided by the former National Educational Welfare Board
ga: • Na seirbhísí a chuir an t-iarBhord Náisiúnta um Leas Oideachas ar fáil roimhe sin

source: • Domestic, sexual and gender-based violence services
ga: • Seirbhísí um fhoréigean teaghlaigh, gnéasach agus bunaithe ar inscne

source: • Services related to the psychological welfare of children
ga: • Seirbhísí a bhaineann leis an leas síceolaíoch leanaí

source: Information on the services it provides is available on its website tusla.ie
ga: Tá faisnéis faoi na seirbhísí a sholáthraíonn sí ar fáil ar a láithreán Gréasáin tusla.ie
